// pages/ask/ask.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    questions:[{
      question:'输入工号和密码怎么登不进去？',
      answer: ['请确保输入工号和密码正确，然后联系工程师。']
    },{
        question:'触屏不灵敏怎么办？',
        answer:['请重重的按屏幕，放心，不会坏的。']
    },{
        question:'硬件初始化失败怎么处理？',
        answer:['请联系售后工程师。']
    },{
        question:'入库有箱子怎么处理？',
        answer:['点击系统维护','报警日志','点击清除报警即可']
    },{
        question:'出库无箱子如何处理？',
        answer:['点击系统维护','报警日志','点击清除报警即可']
    },{
        question:'系统提示箱子被卡如何处理？',
        answer: ['按下红色急停按钮','打开仓库门','把箱子摆正放在机械手上','关闭仓门，松开急停按钮','点击初始化']
    },{
        question:'机械手一直停在入库或出口处怎么办？',
        answer:['按下红色急停按钮，然后松开','点击初始化。']
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },
})